app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 20 Apr 2014 19:20:41 UTC +00:00], ["name", ""], ["updated_at", Sun, 20 Apr 2014 19:20:41 UTC +00:00]]
---
  def create
  #  binding.pry
    @category = Category.new  category_params
    if @category.save