app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "9"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "save "], ["created_at", Sun, 27 Apr 2014 17:14:08 UTC +00:00], ["post_id", 9], ["updated_at", Sun, 27 Apr 2014 17:14:08 UTC +00:00]]
---
  def create
    binding.pry
    @post = Post.find(params[:post_id])
    @comment = Comment.new(params.require(:comment).permit(:body))
    @comment.post = @post

    if @comment.save