app/controllers/posts_controller.rb

  def index
    @posts=Post.all
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT 1

  def create
#    binding.pry
  @post = Post.new post_params
    @post.user = User.first

    if @post.save
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT 1
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 13 Apr 2014 18:36:02 UTC +00:00], ["description", "Lately "], ["title", "Johnny "], ["updated_at", Sun, 13 Apr 2014 18:36:02 UTC +00:00], ["url", "Come"], ["user_id", 6]]

  def update
    if  @post.update_attributes(post_params)
---
UPDATE "posts" SET "url" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = 9  [["url", "www.dailynews.com"], ["description", "This is the description with another update and another"], ["updated_at", Thu, 17 Apr 2014 05:03:50 UTC +00:00]]

 def set_post
  @post = Post.find params[:id]
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "9"]]